app/controllers/movie_controller.rb

  def create_movie_time
    movie_time_params = params.require(:movie_time).permit(:movie_id, :time, :date_start,
                                                           :date_end, :room)
    Rails.logger.debug(movie_time_params)
    movie_time = MovieTime.create(movie_time_params)
---
INSERT INTO "movie_times" ("room", "time", "created_at", "updated_at", "date_start", "date_end", "movie_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"