app/controllers/products_controller.rb

SELECT "products".* FROM "products"
---
  def index
    @products = if params[:select_category].present?
                  if params[:select_category] == 'All'
                    Product.all

INSERT INTO "products" ("price", "category", "weight", "volume", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["price", 10], ["category", "Bebestible"], ["weight", 10.0], ["volume", 10.0], ["created_at", "2022-10-18 22:41:47.469963"], ["updated_at", "2022-10-18 22:41:47.469963"]]
---
  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save