app/models/movie_time.rb

SELECT "movie_times".* FROM "movie_times" WHERE ((('2022-10-30' <= date_end and '2022-10-30' >= date_start) or ('2022-10-26' <= date_end and '2022-10-26' >= date_start)) and time = 'MATINÉ' and room = 1)
---
  def validate_date
    return if date_start.nil? || date_end.nil?

    if date_start > date_end
      errors.add(:date_start,
                 'El día de inicio tiene que ser antes o igual al día de termino')
    end
    # rubocop:disable Layout/LineLength
    query_text = '((? <= date_end and ? >= date_start) or (? <= date_end and ? >= date_start)) and time = ? and room = ?'
    # rubocop:enable Layout/LineLength
    query = MovieTime.where([query_text, date_start, date_start, date_end, date_end, time, room])