app/views/movie/new.html.erb

SELECT "movies".* FROM "movies" ORDER BY "movies"."title" ASC
---
          <div class="select is-fullwidth">
            <%= form.collection_select :movie_id, Movie.all.order(:title), :id, :title, class:'select' %>